<a href="https://colab.research.google.com/github/ZacharyXue/Python-Learning-Note/blob/main/Pandas%E5%9F%BA%E7%A1%80_%E7%AC%94%E8%AE%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

摘录阿里云[Pandas基础](https://tianchi.aliyun.com/notebook-ai/detail?spm=5176.12281976.0.0.36ba1c27kOHLUY&postId=6068)，Pandas真的不是很熟悉，所以还是需要认真学习啊！

# 1. 数据结构简介

在pandas中有两类非常重要的数据结构，序列Series和数据框DataFrame。

Series类似于numpy中的**一维数组**，除了通吃一维数组可用的函数或方法，而且其可通过索引标签的方式获取数据，还具有索引的自动对齐功能；

DataFrame类似于numpy中的**二维数组**，同样可以通用numpy数组的函数和方法，而且还具有其他灵活应用。

## Series的创建

有三种方式可以创建Series：

1. 通过一维数组创建序列

In [ ]:
import numpy as np, pandas as pd

In [ ]:
arr1 = np.arange(10)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [ ]:
s1 = pd.Series(arr1)
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

2. 通过字典方式创建序列

In [ ]:
dic1 = {'a':10,'b':20,'c':30,'d':40,'e':50}
s2 = pd.Series(dic1)
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

3. 通过DataFrame中的某一行或某一列创建序列

## DataFrame的创建方式

DataFrame也主要有三种创建方式：

1. 通过二维数组进行创建

In [ ]:
arr2 = np.arange(12).reshape(3,4)
arr2

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
df1 = pd.DataFrame(arr2)
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

2. 通过字典的方式来创建

通过字典列表创建：

In [ ]:
dic2 = {'a':[1,2,3,4],'b':[5,6,7,8],'c':[9,10,11,12],'d':[13,14,15,16]}
df2 = pd.DataFrame(dic2)
df2

   a  b   c   d
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

  从上面可以看出来字典关键字在创建DataFrame时是用作columns的。

  使用嵌套字典来创建：

In [ ]:
dic3 = {'one':{'a':1,'b':2,'c':3,'d':4},'two':{'a':5,'b':6,'c':7,'d':8},'three':{'a':9,'b':10,'c':11,'d':12}}
df3 = pd.DataFrame(dic3)
df3

   one  two  three
a    1    5      9
b    2    6     10
c    3    7     11
d    4    8     12

  使用嵌套字典创建的时候，外围的关键字为columns，内部的关键字为index。

3. 使用其他DataFrame来创建

In [ ]:
df4 = df3[['one','two']]
df4

   one  two
a    1    5
b    2    6
c    3    7
d    4    8

In [ ]:
s3 = df3['one']
type(s3)

pandas.core.series.Series

# 数据索引index

## 通过索引值或索引标签获取数据

In [ ]:
s4 = pd.Series([1,2,3,4,5,7])
s4

0    1
1    2
2    3
3    4
4    5
5    7
dtype: int64

In [ ]:
s4.index

RangeIndex(start=0, stop=6, step=1)

In [ ]:
s4.index = ['a','b','c','d','e','f']
s4

a    1
b    2
c    3
d    4
e    5
f    7
dtype: int64

In [ ]:
s4[3]

4

In [ ]:
s4['d']

4

In [ ]:
s4[:'e']

a    1
b    2
c    3
d    4
e    5
dtype: int64

千万注意：如果通过索引标签获取数据的话，**末端标签所对应的值是可以返回的**！在一维数组中，就无法通过索引标签获取数据，这也是序列不同于一维数组的一个方面。

## 自动化对齐

如果有两个序列，需要对这两个序列进行算术运算，这时索引的存在就体现的它的价值了—自动化对齐.

In [ ]:
s5 = pd.Series(np.array([10,15,20,30,55,80]),index = ['a','b','c','d','e','f'])
s6 = pd.Series(np.array([12,11,13,15,14,16]),index = ['a','c','g','b','d','f'])
s5 / s6

a    0.833333
b    1.000000
c    1.818182
d    2.142857
e         NaN
f    5.000000
g         NaN
dtype: float64

由于s5中没有对应的g索引，s6中没有对应的e索引，所以数据的运算会产生两个缺失值NaN。注意，这里的算术结果就实现了两个序列索引的自动对齐，而非简单的将两个序列加总或相除。对于DataFrame的对齐，不仅仅是行索引的自动对齐，同时也会自动对齐列索引（变量名）

DataFrame中同样有索引，而且**DataFrame是二维数组的推广**，所以其不仅有行索引，而且还存在列索引。

# 3. 利用pandas查询数据

In [ ]:
stu_dic = {'Age':[14,13,13,14,14,12,12,15,13,12,11,14,12,15,16,12,15,11,15],
'Height':[69,56.5,65.3,62.8,63.5,57.3,59.8,62.5,62.5,59,51.3,64.3,56.3,66.5,72,64.8,67,57.5,66.5],
'Name':['Alfred','Alice','Barbara','Carol','Henry','James','Jane','Janet','Jeffrey','John','Joyce','Judy','Louise','Marry','Philip','Robert','Ronald','Thomas','Willam'],
'Sex':['M','F','F','F','M','M','F','F','M','M','F','F','F','F','M','M','M','M','M'],
'Weight':[112.5,84,98,102.5,102.5,83,84.5,112.5,84,99.5,50.5,90,77,112,150,128,133,85,112]}
student = pd.DataFrame(stu_dic)

## 查询数据的前5行或末尾5行

In [ ]:
student.head()

   Age  Height     Name Sex  Weight
0   14    69.0   Alfred   M   112.5
1   13    56.5    Alice   F    84.0
2   13    65.3  Barbara   F    98.0
3   14    62.8    Carol   F   102.5
4   14    63.5    Henry   M   102.5

In [ ]:
student.tail()

    Age  Height    Name Sex  Weight
14   16    72.0  Philip   M   150.0
15   12    64.8  Robert   M   128.0
16   15    67.0  Ronald   M   133.0
17   11    57.5  Thomas   M    85.0
18   15    66.5  Willam   M   112.0

从上面可以看出`head`和`tail`默认都是返回5行数据。

## 查询指定的行

注意：这里的索引标签函数必须是中括号[]

`loc`是按index值进行索引，而`iloc`是按照行号进行索引。

In [ ]:
student.loc[[1,2,5]]

   Age  Height     Name Sex  Weight
1   13    56.5    Alice   F    84.0
2   13    65.3  Barbara   F    98.0
5   12    57.3    James   M    83.0

In [ ]:
student.iloc[[1,2,5]]

   Age  Height     Name Sex  Weight
1   13    56.5    Alice   F    84.0
2   13    65.3  Barbara   F    98.0
5   12    57.3    James   M    83.0

## 查询指定的列

如果多个列的话，必须使用双重中括号

In [ ]:
student[['Age','Name']].head()

   Age     Name
0   14   Alfred
1   13    Alice
2   13  Barbara
3   14    Carol
4   14    Henry

## 通过loc索引标签查询指定的列

In [ ]:
student.loc[:,['Name','Height','Weight']].head()

      Name  Height  Weight
0   Alfred    69.0   112.5
1    Alice    56.5    84.0
2  Barbara    65.3    98.0
3    Carol    62.8   102.5
4    Henry    63.5   102.5

## 条件查询

In [ ]:
student[(student['Sex']=='F') & (student['Age']>12)]

    Age  Height     Name Sex  Weight
1    13    56.5    Alice   F    84.0
2    13    65.3  Barbara   F    98.0
3    14    62.8    Carol   F   102.5
7    15    62.5    Janet   F   112.5
11   14    64.3     Judy   F    90.0
13   15    66.5    Marry   F   112.0

In [ ]:
student[(student['Sex']=='F') & (student['Age']>12)][['Name','Height','Weight']]

       Name  Height  Weight
1     Alice    56.5    84.0
2   Barbara    65.3    98.0
3     Carol    62.8   102.5
7     Janet    62.5   112.5
11     Judy    64.3    90.0
13    Marry    66.5   112.0

# 4. 利用pandas的DataFrames进行统计分析

In [ ]:
np.random.seed(1234)
d1 = pd.Series(2*np.random.normal(size = 100)+3)
d2 = np.random.f(2,4,size = 100)
d3 = np.random.randint(1,100,size = 100)

print('非空元素计算: ', d1.count()) #非空元素计算
print('最小值: ', d1.min()) #最小值
print('最大值: ', d1.max()) #最大值
print('最小值的位置: ', d1.idxmin()) #最小值的位置，类似于R中的which.min函数
print('最大值的位置: ', d1.idxmax()) #最大值的位置，类似于R中的which.max函数
print('10%分位数: ', d1.quantile(0.1)) #10%分位数
print('求和: ', d1.sum()) #求和
print('均值: ', d1.mean()) #均值
print('中位数: ', d1.median()) #中位数
print('众数: ', d1.mode()) #众数
print('方差: ', d1.var()) #方差
print('标准差: ', d1.std()) #标准差
print('平均绝对偏差: ', d1.mad()) #平均绝对偏差
print('偏度: ', d1.skew()) #偏度
print('峰度: ', d1.kurt()) #峰度
print('描述性统计指标: ', d1.describe()) #一次性输出多个描述性统计指标

非空元素计算:  100
最小值:  -4.1270333212494705
最大值:  7.781921030926066
最小值的位置:  81
最大值的位置:  39
10%分位数:  0.6870184644069928
求和:  307.0224566250873
均值:  3.070224566250874
中位数:  3.204555266776845
众数:  0    -4.127033
1    -1.800907
2    -1.485370
3    -1.149955
4    -1.042510
        ...
95    5.865414
96    6.091318
97    7.015686
98    7.061207
99    7.781921
Length: 100, dtype: float64
方差:  4.005609378535085
标准差:  2.0014018533355777
平均绝对偏差:  1.5112880411556109
偏度:  -0.6494780760484293
峰度:  1.2201094052398012
描述性统计指标:  count    100.000000
mean       3.070225
std        2.001402
min       -4.127033
25%        2.040101
50%        3.204555
75%        4.434788
max        7.781921
dtype: float64

如何将某一函数应用到数据框中的每一列呢？

可以使用apply函数：

In [ ]:
df = pd.DataFrame(np.array([d1,d2,d3]).T,columns=['x1','x2','x3'])
print(df.head())

         x1        x2    x3
0  3.942870  1.369531  55.0
1  0.618049  0.943264  68.0
2  5.865414  0.590663  73.0
3  2.374696  0.206548  59.0
4  1.558823  0.223204  60.0

In [ ]:
def stats(x):
	return pd.Series([x.count(),x.min(),x.idxmin(),x.quantile(.25),x.median(),x.quantile(.75),
                      x.mean(),x.max(),x.idxmax(),x.mad(),x.var(),x.std(),x.skew(),x.kurt()],
                     index = ['Count','Min','Whicn_Min','Q1','Median','Q3','Mean','Max',
                              'Which_Max','Mad','Var','Std','Skew','Kurt'])
print(stats(d1))

Count        100.000000
Min           -4.127033
Whicn_Min     81.000000
Q1             2.040101
Median         3.204555
Q3             4.434788
Mean           3.070225
Max            7.781921
Which_Max     39.000000
Mad            1.511288
Var            4.005609
Std            2.001402
Skew          -0.649478
Kurt           1.220109
dtype: float64

In [ ]:
print(df.apply(stats))

                   x1          x2          x3
Count      100.000000  100.000000  100.000000
Min         -4.127033    0.014330    3.000000
Whicn_Min   81.000000   72.000000   76.000000
Q1           2.040101    0.249580   25.000000
Median       3.204555    1.000613   54.500000
Q3           4.434788    2.101581   73.000000
Mean         3.070225    2.028608   51.490000
Max          7.781921   18.791565   98.000000
Which_Max   39.000000   53.000000   96.000000
Mad          1.511288    1.922669   24.010800
Var          4.005609   10.206447  780.090808
Std          2.001402    3.194753   27.930106
Skew        -0.649478    3.326246   -0.118917
Kurt         1.220109   12.636286   -1.211579

相关系数：

In [ ]:
df.corr()

          x1        x2        x3
x1  1.000000  0.136085  0.037185
x2  0.136085  1.000000 -0.005688
x3  0.037185 -0.005688  1.000000

In [ ]:
df.corrwith(df['x1'])

x1    1.000000
x2    0.136085
x3    0.037185
dtype: float64

数值型变量间的协方差矩阵

In [ ]:
df.cov()

          x1         x2          x3
x1  4.005609   0.870124    2.078596
x2  0.870124  10.206447   -0.507512
x3  2.078596  -0.507512  780.090808

# 5. 利用pandas实现SQL操作

## 增加新的行或者新的类

In [ ]:
dic = {'Name':['LiuShunxiang','Zhangshan'],'Sex':['M','F'],'Age':[27,23],'Height':[165.7,167.2],'Weight':[61,63]}
student2 = pd.DataFrame(dic)
student2

           Name Sex  Age  Height  Weight
0  LiuShunxiang   M   27   165.7      61
1     Zhangshan   F   23   167.2      63

通过concat函数将student2添加到student中：

In [ ]:
student3 = pd.concat([student,student2])
student3.tail()

    Age  Height          Name Sex  Weight
16   15    67.0        Ronald   M   133.0
17   11    57.5        Thomas   M    85.0
18   15    66.5        Willam   M   112.0
0    27   165.7  LiuShunxiang   M    61.0
1    23   167.2     Zhangshan   F    63.0

如果想新增列的话：

In [ ]:
pd.DataFrame(student2,columns=['Age','Height','Name','Sex','Weight','Score'])

   Age  Height          Name Sex  Weight  Score
0   27   165.7  LiuShunxiang   M      61    NaN
1   23   167.2     Zhangshan   F      63    NaN

注意，新增的列如果没有赋值，所显示值为`NaN`。

## 删除行或者列

使用`del`命令可以删除Python所有对象。

删除指定的行

In [ ]:
student.drop([0,1,3,6])

    Age  Height     Name Sex  Weight
2    13    65.3  Barbara   F    98.0
4    14    63.5    Henry   M   102.5
5    12    57.3    James   M    83.0
7    15    62.5    Janet   F   112.5
8    13    62.5  Jeffrey   M    84.0
9    12    59.0     John   M    99.5
10   11    51.3    Joyce   F    50.5
11   14    64.3     Judy   F    90.0
12   12    56.3   Louise   F    77.0
13   15    66.5    Marry   F   112.0
14   16    72.0   Philip   M   150.0
15   12    64.8   Robert   M   128.0
16   15    67.0   Ronald   M   133.0
17   11    57.5   Thomas   M    85.0
18   15    66.5   Willam   M   112.0

In [ ]:
student

    Age  Height     Name Sex  Weight
0    14    69.0   Alfred   M   112.5
1    13    56.5    Alice   F    84.0
2    13    65.3  Barbara   F    98.0
3    14    62.8    Carol   F   102.5
4    14    63.5    Henry   M   102.5
5    12    57.3    James   M    83.0
6    12    59.8     Jane   F    84.5
7    15    62.5    Janet   F   112.5
8    13    62.5  Jeffrey   M    84.0
9    12    59.0     John   M    99.5
10   11    51.3    Joyce   F    50.5
11   14    64.3     Judy   F    90.0
12   12    56.3   Louise   F    77.0
13   15    66.5    Marry   F   112.0
14   16    72.0   Philip   M   150.0
15   12    64.8   Robert   M   128.0
16   15    67.0   Ronald   M   133.0
17   11    57.5   Thomas   M    85.0
18   15    66.5   Willam   M   112.0

注意，这里都是函数返回删除后的数据，并不是对原数据进行更改，这可能是pandas设计时候的思路吧？

根据布尔索引进行数据的删除：

In [ ]:
student[student['Age'] > 14]

    Age  Height    Name Sex  Weight
7    15    62.5   Janet   F   112.5
13   15    66.5   Marry   F   112.0
14   16    72.0  Philip   M   150.0
16   15    67.0  Ronald   M   133.0
18   15    66.5  Willam   M   112.0

删除指定列：

In [ ]:
student.drop(['Height','Weight'],axis=1).head()

   Age     Name Sex
0   14   Alfred   M
1   13    Alice   F
2   13  Barbara   F
3   14    Carol   F
4   14    Henry   M

不论是删除行还是删除列，都可以通过drop方法实现，只需要设定好删除的轴即可，即调整drop方法中的axis参数。默认该参数为0，表示删除行观测，如果需要删除列变量，则需设置为1。

## 修改原始记录的值

In [ ]:
student3.loc[student3['Name'] == 'LiuShunxiang','Height']=173
student3[student3['Name'] == 'LiuShunxiang']

   Age  Height          Name Sex  Weight
0   27   173.0  LiuShunxiang   M    61.0

## 聚合操作

pandas模块中可以通过groupby()函数实现数据的聚合操作。

In [ ]:
student.groupby('Sex').mean()

           Age     Height      Weight
Sex
F    13.222222  60.588889   90.111111
M    13.400000  63.910000  108.950000

不对年龄取均值：

In [ ]:
student.drop('Age',axis=1).groupby('Sex').mean()

        Height      Weight
Sex
F    60.588889   90.111111
M    63.910000  108.950000

groupby还可以使用多个分组变量:

In [ ]:
student.groupby(['Sex','Age']).mean()

            Height  Weight
Sex Age
F   11   51.300000   50.50
    12   58.050000   80.75
    13   60.900000   91.00
    14   63.550000   96.25
    15   64.500000  112.25
M   11   57.500000   85.00
    12   60.366667  103.50
    13   62.500000   84.00
    14   66.250000  107.50
    15   66.750000  122.50
    16   72.000000  150.00

对每个分组计算多个统计量：

In [ ]:
student.drop('Age',axis=1).groupby('Sex').agg([np.mean,np.median])

        Height             Weight
          mean median        mean  median
Sex
F    60.588889  62.50   90.111111   90.00
M    63.910000  64.15  108.950000  107.25

## 排序

可以使用sort_index和sort_values实现序列和数据框的排序工作：

In [ ]:
Data = pd.Series(np.array(np.random.randint(1,20,10)))
Data.sort_index()

0     6
1    19
2    13
3    13
4     5
5    17
6     9
7     9
8     4
9    11
dtype: int64

In [ ]:
Data.sort_values()

8     4
4     5
0     6
6     9
7     9
9    11
2    13
3    13
5    17
1    19
dtype: int64

In [ ]:
student.sort_values(by=['Age','Height'])

    Age  Height     Name Sex  Weight
10   11    51.3    Joyce   F    50.5
17   11    57.5   Thomas   M    85.0
12   12    56.3   Louise   F    77.0
5    12    57.3    James   M    83.0
9    12    59.0     John   M    99.5
6    12    59.8     Jane   F    84.5
15   12    64.8   Robert   M   128.0
1    13    56.5    Alice   F    84.0
8    13    62.5  Jeffrey   M    84.0
2    13    65.3  Barbara   F    98.0
3    14    62.8    Carol   F   102.5
4    14    63.5    Henry   M   102.5
11   14    64.3     Judy   F    90.0
0    14    69.0   Alfred   M   112.5
7    15    62.5    Janet   F   112.5
13   15    66.5    Marry   F   112.0
18   15    66.5   Willam   M   112.0
16   15    67.0   Ronald   M   133.0
14   16    72.0   Philip   M   150.0

## 多表连接

pandas使用merger函数实现数据的各种连接操作。

In [ ]:
dic2 = {'Name':['Alfred','Alice','Barbara','Carol','Henry','Jeffrey','Judy','Philip','Robert','Willam'],
        'Score':[88,76,89,67,79,90,92,86,73,77]}
score = pd.DataFrame(dic2)

In [ ]:
stu_score1 = pd.merge(student, score, on='Name')
stu_score1

   Age  Height     Name Sex  Weight  Score
0   14    69.0   Alfred   M   112.5     88
1   13    56.5    Alice   F    84.0     76
2   13    65.3  Barbara   F    98.0     89
3   14    62.8    Carol   F   102.5     67
4   14    63.5    Henry   M   102.5     79
5   13    62.5  Jeffrey   M    84.0     90
6   14    64.3     Judy   F    90.0     92
7   16    72.0   Philip   M   150.0     86
8   12    64.8   Robert   M   128.0     73
9   15    66.5   Willam   M   112.0     77

默认情况下，merge函数实现的是两个表之间的内连接，即**返回两张表中共同部分的数据**。可以通过how参数设置连接的方式，left为左连接；right为右连接；outer为外连接。

In [ ]:
stu_score2 = pd.merge(student, score, on='Name', how='left')
stu_score2

    Age  Height     Name Sex  Weight  Score
0    14    69.0   Alfred   M   112.5   88.0
1    13    56.5    Alice   F    84.0   76.0
2    13    65.3  Barbara   F    98.0   89.0
3    14    62.8    Carol   F   102.5   67.0
4    14    63.5    Henry   M   102.5   79.0
5    12    57.3    James   M    83.0    NaN
6    12    59.8     Jane   F    84.5    NaN
7    15    62.5    Janet   F   112.5    NaN
8    13    62.5  Jeffrey   M    84.0   90.0
9    12    59.0     John   M    99.5    NaN
10   11    51.3    Joyce   F    50.5    NaN
11   14    64.3     Judy   F    90.0   92.0
12   12    56.3   Louise   F    77.0    NaN
13   15    66.5    Marry   F   112.0    NaN
14   16    72.0   Philip   M   150.0   86.0
15   12    64.8   Robert   M   128.0   73.0
16   15    67.0   Ronald   M   133.0    NaN
17   11    57.5   Thomas   M    85.0    NaN
18   15    66.5   Willam   M   112.0   77.0

左连接实现的是**保留student表中的所有信息**，同时将score表的信息与之配对，能配多少配多少，对于没有配对上的Name，将会显示成绩为NaN。

# 6. 利用pandas进行缺失值的处理

In [ ]:
s = stu_score2['Score']
s

0     88.0
1     76.0
2     89.0
3     67.0
4     79.0
5      NaN
6      NaN
7      NaN
8     90.0
9      NaN
10     NaN
11    92.0
12     NaN
13     NaN
14    86.0
15    73.0
16     NaN
17     NaN
18    77.0
Name: Score, dtype: float64

结合sum函数和isnull函数来检测数据中含有多少缺失值：

In [ ]:
sum(pd.isnull(s))

9

直接删除缺失值：

In [ ]:
s.dropna()

0     88.0
1     76.0
2     89.0
3     67.0
4     79.0
8     90.0
11    92.0
14    86.0
15    73.0
18    77.0
Name: Score, dtype: float64

默认情况下，`dropna()`会删除所有含有缺示值的行：

In [ ]:
df = pd.DataFrame([[1,1,2],[3,5,np.nan],[13,21,34],[55,np.nan,10],[np.nan,np.nan,np.nan],[np.nan,1,2]],columns=('x1','x2','x3'))
df

     x1    x2    x3
0   1.0   1.0   2.0
1   3.0   5.0   NaN
2  13.0  21.0  34.0
3  55.0   NaN  10.0
4   NaN   NaN   NaN
5   NaN   1.0   2.0

In [ ]:
df.dropna()

     x1    x2    x3
0   1.0   1.0   2.0
2  13.0  21.0  34.0

In [ ]:
df.dropna(how='all')

     x1    x2    x3
0   1.0   1.0   2.0
1   3.0   5.0   NaN
2  13.0  21.0  34.0
3  55.0   NaN  10.0
5   NaN   1.0   2.0

使用`fillna()`来填补缺失值：

In [ ]:
df.fillna(0)

     x1    x2    x3
0   1.0   1.0   2.0
1   3.0   5.0   0.0
2  13.0  21.0  34.0
3  55.0   0.0  10.0
4   0.0   0.0   0.0
5   0.0   1.0   2.0

采用前项或者后项填充：

In [ ]:
df.fillna(method='ffill')

     x1    x2    x3
0   1.0   1.0   2.0
1   3.0   5.0   2.0
2  13.0  21.0  34.0
3  55.0  21.0  10.0
4  55.0  21.0  10.0
5  55.0   1.0   2.0

In [ ]:
df.fillna(method='bfill')

     x1    x2    x3
0   1.0   1.0   2.0
1   3.0   5.0  34.0
2  13.0  21.0  34.0
3  55.0   1.0  10.0
4   NaN   1.0   2.0
5   NaN   1.0   2.0

使用常量来填充不同的列：

In [ ]:
x1_median = df['x1'].median()
x2_mean = df['x2'].mean()
x3_mean = df['x3'].mean()
df.fillna({'x1':x1_median,'x2':x2_mean,'x3':x3_mean})

     x1    x2    x3
0   1.0   1.0   2.0
1   3.0   5.0  12.0
2  13.0  21.0  34.0
3  55.0   7.0  10.0
4   8.0   7.0  12.0
5   8.0   1.0   2.0

很显然，在使用填充法时，相对于常数填充或前项、后项填充，使用各列的众数、均值或中位数填充要更加合理一点。

# 8. 多层索引使用

在序列中它可以实现在一个轴上拥有多个索引。

In [ ]:
s = pd.Series(np.arange(1,10),index=[["a","a","a","b","b","c","c","d","d"],[1,2,3,1,2,3,1,2,3]])
s

a  1    1
   2    2
   3    3
b  1    4
   2    5
c  3    6
   1    7
d  2    8
   3    9
dtype: int64

In [ ]:
s.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 3),
            ('c', 1),
            ('d', 2),
            ('d', 3)],
           )

In [ ]:
s['a']

1    1
2    2
3    3
dtype: int64

In [ ]:
s['a',1]

1

In [ ]:
s['a'][[1,3]]

1    1
3    3
dtype: int64

In [ ]:
s[['a','c']]

a  1    1
   2    2
   3    3
c  3    6
   1    7
dtype: int64

In [ ]:
s['b':'d']

b  1    4
   2    5
c  3    6
   1    7
d  2    8
   3    9
dtype: int64

通过unstack方法可以将Series变成一个DataFrame.

In [ ]:
s.unstack()

     1    2    3
a  1.0  2.0  3.0
b  4.0  5.0  NaN
c  7.0  NaN  6.0
d  NaN  8.0  9.0

DataFrame的层级化索引：

In [ ]:
data = pd.DataFrame(np.random.randint(0,150,size=(8,12)),
               columns = pd.MultiIndex.from_product([['模拟考','正式考'],['数学','语文','英语','物理','化学','生物']]),
               index = pd.MultiIndex.from_product([['期中','期末'],['雷军','李斌'],['测试一','测试二']]))
data.shape

(8, 12)

In [ ]:
data['模拟考'][['语文','数学']].head()

            语文   数学
期中 雷军 测试一   14  104
      测试二   18    6
   李斌 测试一   25   27
      测试二  140  113
期末 雷军 测试一  148    7

In [ ]:
data.loc['期中','雷军','测试一']['模拟考','数学']

104